#+BEGIN: clocktable :maxlevel 3 :scope file
#+END:

* Retrobattle
** Features
*** Arrows in menu screen
*** Polka-tiles in bonus levels
*** Score above bonus when picking up
*** Variable location of data files (currently ../ )
*** Demo recording & playback
*** Remove text "PRESS SPACE TO SET KEYS" when quitting
*** make depend
** Features done 
*** If quitting when paused, remove pause helmet
*** Quitting while paused, then restarting -> NO ANIMATIONS! (pause all?)
*** Nicer death animation for Space Viper/Dire Space Viper
*** Put config files in ~/.config/retrobattle/
*** Create ~/.config/retrobattle dir if it doesn't exist
*** Show correct enemy variant in score screen
*** No enemies should enter spikes
*** Pause enemy while captain goods death animation begins
*** Transparency for clock object in Bonus Score Screen
*** Reset score keeper stats when starting over
*** 8th square should be visible in bullet reloader
*** Key binding redefinition
*** Extra lives
*** NO BONUS if dead/timeout
*** Fuzz seems to randomize direction after being frozen (no, it doesn't)
*** Fuzz should rotate in the air
*** Show "Stage X" right before stage starts
*** Pushing fuzz outside of screen should wrap it around (2 sprites?)
    Might be better to make the buffer outside of the screen wider, to
    allow both Captain Good and a Fuzz to fit outside. Will take
    longer to walk around the edge of the screen, but it would
    probably be nicest. This should be much more general (all enemies
    and Captain Good should adhere to this).
*** Correct roll direction animation for fuzz (red and blue)
*** Dark Bounty Hunter
*** Red Fuzz gets stuck for some reason (random direction reason?)
    Maybe happens when direction gets randomized at exactly the same time
    that the Fuzz hits the ground for the first time!
*** Dire Space Viper
*** Gold Drone
*** Red Fuzz
*** Show helmet (location of Captain Good) when pausing
*** Show ammunition left above Captain Good when firing and getting back ammo
*** Explosions when Bounty Hunter is killed
   :CLOCK:
   CLOCK: [2009-03-01 Sun 11:29]--[2009-03-01 Sun 11:29] =>  0:00
   CLOCK: [2009-03-01 Sun 10:56]--[2009-03-01 Sun 11:29] =>  0:33
   CLOCK: [2009-01-25 Sun 11:03]--[2009-01-25 Sun 11:04] =>  0:01
   :END:CLOCK:
*** Space Viper should break a block if completely surrounded
   :CLOCK:
   CLOCK: [2009-03-01 Sun 14:12]--[2009-03-01 Sun 14:12] =>  0:00
   CLOCK: [2009-03-01 Sun 11:30]--[2009-03-01 Sun 12:11] =>  0:41
   :END:CLOCK:CLOCK:
*** Space Viper,
*** Bounty Hunter,
*** Correct length of Space Viper
*** Done power-ups
**** SMALL_COINS
**** DIAMOND
**** GOLD_BAR
**** BLUE_PEARL
**** WHITE_BALL
**** LOCK
**** CLOCK
**** POWER_GUN
   :CLOCK:
   CLOCK: [2009-03-29 Sun 08:09]--[2009-03-29 Sun 10:42] =>  2:33
   CLOCK: [2009-03-27 Fri 13:23]--[2009-03-27 Fri 13:23] =>  0:00
  :END:CLOCK:
**** LASER_GUN
     CLOCK: [2009-03-29 Sun 11:30]--[2009-03-29 Sun 12:06] =>  0:36
**** BOMB
**** QUAKE
*** If walking right, then pressing left, walk left until left is released
*** Space Viper head should replace sprite index
